# ============================================================================
#                         HOMEBREW BUNDLE (macOS)
#                    github.com/wit543/dotfiles
# ============================================================================
# Install: brew bundle --file=Brewfile
# Update:  brew bundle --file=Brewfile && brew upgrade
# ============================================================================

# ============================================================================
# TAPS (Third-party Repositories)
# ============================================================================
# NOTE: homebrew/bundle and homebrew/cask-fonts are now deprecated
#       Fonts are available directly via "brew install --cask font-*"

# ============================================================================
# CORE CLI TOOLS
# ============================================================================
# NOTE: Essential command-line utilities

brew "git"                            # Version control
brew "zsh"                            # Default shell
brew "wget"                           # File downloader
brew "curl"                           # URL transfers
brew "neovim"                         # Modern vim
brew "tmux"                           # Terminal multiplexer
brew "expect"                         # Interactive automation

# ============================================================================
# SHELL - PROMPT & PLUGINS
# ============================================================================
# NOTE: Starship prompt and Zinit managed via install script

brew "starship"                       # Cross-shell prompt (replaces P10k)
brew "zoxide"                         # Smarter cd command (replaces z)

# ============================================================================
# SEARCH & NAVIGATION
# ============================================================================
# NOTE: Fast file/content searching

brew "fzf"                            # Fuzzy finder (Ctrl+R, Ctrl+T)
brew "ripgrep"                        # Fast grep (rg)
brew "fd"                             # Fast find
brew "tree"                           # Directory tree view (fallback)

# ============================================================================
# MODERN CLI REPLACEMENTS
# ============================================================================
# NOTE: Better alternatives to standard tools (with silent fallbacks)

brew "bat"                            # cat with syntax highlighting
brew "eza"                            # ls replacement (colors, git, icons)
brew "git-delta"                      # Better git diff viewer
brew "dust"                           # du replacement (disk usage)
brew "procs"                          # ps replacement (process viewer)
brew "sd"                             # sed replacement (find & replace)
brew "jq"                             # JSON processor
brew "yq"                             # YAML processor (like jq for YAML)
brew "htop"                           # Interactive process viewer (fallback)
brew "tldr"                           # Simplified man pages with examples
brew "thefuck"                        # Auto-correct previous command typos
brew "hyperfine"                      # Command benchmarking tool

# ============================================================================
# TUI PRODUCTIVITY TOOLS
# ============================================================================
# NOTE: Terminal UI tools for git and docker

brew "lazygit"                        # Git TUI (lg)
brew "lazydocker"                     # Docker TUI (lzd)
brew "yazi"                           # Terminal file manager (2024 trending)
brew "btop"                           # Beautiful system monitor TUI

# ============================================================================
# DEVELOPMENT
# ============================================================================
# NOTE: Programming languages and tools

brew "node"                           # Node.js runtime
brew "python@3"                       # Python 3
brew "go"                             # Go language

# ============================================================================
# CLOUD & INFRASTRUCTURE
# ============================================================================
# NOTE: Google Cloud SDK for gcloud, gsutil, bq commands

cask "google-cloud-sdk"

# ============================================================================
# FONTS
# ============================================================================
# NOTE: Required for Starship prompt icons (Nerd Font)

cask "font-meslo-lg-nerd-font"        # Powerline + Nerd Font icons

# ============================================================================
# APPLICATIONS (Casks)
# ============================================================================
# NOTE: GUI applications installed via Homebrew

cask "iterm2"                         # Terminal emulator (stable)
cask "ghostty"                        # GPU-accelerated terminal (2025 trending)
cask "visual-studio-code"             # Code editor
cask "docker"                         # Container platform
cask "google-chrome"                  # Web browser
cask "raycast"                        # Spotlight replacement (productivity)

# ============================================================================
# END OF BREWFILE
# ============================================================================
